Tekla.Structures.DirectManipulation.Model.CreationCommands.MaterialSpecificProvider
The Tekla.Structures.DirectManipulation.Model.CreationCommands.MaterialSpecificProvider class provides creation commands specific for the expected object material.

Tekla.Structures.DirectManipulation.Model.CreationCommands.MaterialSpecificProvider.type
The System.Type value describing the target type.

Tekla.Structures.DirectManipulation.Model.CreationCommands.MaterialSpecificProvider.typeString
The System.String value identifying the target object type.

Tekla.Structures.DirectManipulation.Model.CreationCommands.MaterialSpecificProvider.#ctor(System.Type)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Model.CreationCommands.MaterialSpecificProvider class.
targetType: The System.Type value describing the target type of the creation commands.

Tekla.Structures.DirectManipulation.Model.CreationCommands.MaterialSpecificProvider.#ctor(System.Type,System.String)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Model.CreationCommands.MaterialSpecificProvider class.
targetType: The System.Type value describing the target type of the creation commands.
targetTypeAsString: The System.String value identifying the target object type of the creation commands.

Tekla.Structures.DirectManipulation.Model.CreationCommands.MaterialSpecificProvider.Concrete
Gets the creation creation commands for an object with concrete material.

Tekla.Structures.DirectManipulation.Model.CreationCommands.MaterialSpecificProvider.Steel
Gets the creation creation commands for an object with steel material.